{
  "positions": [
    {
      "title": "AI Consultant",
      "description": "As an AI Consultant, you will develop and lead training programs on AI technologies, help organizations integrate AI solutions, and provide expertise on modern AI architectures including LLMs, RAG systems, and agent frameworks. You'll need strong technical knowledge combined with excellent communication skills to translate complex concepts for diverse audiences.",
      "questions": [
        {
          "question": "Can you explain your experience implementing Large Language Models (LLMs) in enterprise environments?",
          "expectation": "Answer should include specific LLM implementations, challenges faced, solutions developed, and business outcomes achieved."
        },
        {
          "question": "How would you approach designing a training program on AI for non-technical business stakeholders?",
          "expectation": "Answer should cover needs assessment, content simplification strategies, practical examples, and methods to measure understanding."
        },
        {
          "question": "What strategies have you used to evaluate the ROI of AI implementations?",
          "expectation": "Answer should mention specific metrics, measurement frameworks, and examples of how ROI was calculated for past projects."
        },
        {
          "question": "Describe your experience with Retrieval Augmented Generation (RAG) systems and their practical applications.",
          "expectation": "Answer should demonstrate understanding of RAG architecture, implementation experience, and specific use cases where it provided value."
        },
        {
          "question": "How do you stay current with rapidly evolving AI technologies and regulations like the AI Act?",
          "expectation": "Answer should include specific information sources, learning methods, and examples of applying new knowledge in practice."
        }
      ]
    },
    {
      "title": "Data Science",
      "description": "As a Data Scientist, you will develop predictive models and algorithms to drive business decisions, collaborate with cross-functional teams to understand data requirements, and translate complex analytical findings into actionable insights. You'll work with large datasets using SQL, Python, and visualization tools to create interactive dashboards for stakeholders.",
      "questions": [
        {
          "question": "What experience do you have with building and optimizing ETL pipelines using tools like Apache Airflow?",
          "expectation": "Answer should include specific ETL projects, optimization techniques, and experience with scheduling and monitoring data pipelines."
        },
        {
          "question": "Describe a challenging data science project you've worked on and how you approached the problem.",
          "expectation": "Answer should demonstrate problem-solving methodology, technical approaches used, challenges overcome, and measurable outcomes."
        }
      ]
    },
    {
      "title": "Java developer",
      "description": "As a Java Developer, you will design, implement, and maintain Java applications, collaborate with cross-functional teams to define software requirements, and ensure high-quality code through testing and code reviews. You'll work with frameworks like Spring Boot, manage database interactions, and implement RESTful APIs for enterprise applications.",
      "questions": [
        {
          "question": "What experience do you have with Spring Boot and the Spring ecosystem?",
          "expectation": "Answer should include specific Spring projects, components used (Spring Security, Data, etc.), and examples of applications built."
        },
        {
          "question": "How do you approach testing in Java applications? What frameworks do you prefer?",
          "expectation": "Answer should cover unit, integration, and end-to-end testing strategies, specific frameworks (JUnit, Mockito, etc.), and test-driven development experience."
        },
        {
          "question": "Describe your experience with microservices architecture and implementation.",
          "expectation": "Answer should demonstrate understanding of microservices principles, implementation experience, and approaches to service communication and deployment."
        },
        {
          "question": "How do you optimize Java application performance and handle memory management?",
          "expectation": "Answer should include profiling techniques, JVM tuning experience, garbage collection optimization, and specific performance improvements achieved."
        },
        {
          "question": "What's your approach to implementing secure coding practices in Java applications?",
          "expectation": "Answer should cover OWASP principles, security frameworks, authentication/authorization implementation, and secure data handling practices."
        }
      ]
    },
    {
      "title": "Cloud Architect",
      "description": "As a Cloud Architect, you will design and implement scalable, secure, and resilient cloud infrastructure solutions, lead cloud migration strategies, optimize cloud costs, and ensure compliance with security best practices. You'll work with multiple cloud platforms (AWS, Azure, GCP), infrastructure-as-code tools, and containerization technologies to deliver enterprise-grade cloud environments.",
      "questions": [
        {
          "question": "How do you approach designing a multi-region, highly available cloud architecture?",
          "expectation": "Answer should include disaster recovery strategies, data replication approaches, global load balancing techniques, and experience with specific cloud services that enable high availability."
        },
        {
          "question": "What strategies have you used to optimize cloud costs without compromising performance?",
          "expectation": "Answer should cover resource right-sizing, reserved instances, spot instances, serverless architectures, and specific cost reduction examples with metrics."
        },
        {
          "question": "Describe your experience implementing infrastructure-as-code and CI/CD pipelines for cloud deployments.",
          "expectation": "Answer should demonstrate experience with specific IaC tools (Terraform, CloudFormation, etc.), CI/CD platforms, and automated testing/deployment strategies."
        },
        {
          "question": "How do you approach security and compliance in cloud environments?",
          "expectation": "Answer should include security frameworks, compliance standards (SOC2, HIPAA, etc.), identity management approaches, and automated security scanning/monitoring."
        },
        {
          "question": "What experience do you have with containerization and orchestration technologies?",
          "expectation": "Answer should cover Docker, Kubernetes, service mesh technologies, and specific container deployment patterns and challenges."
        }
      ]
    }
  ]
}